export const moon = {
    id: 'moon',
    name: 'Луна',
    subtitle: 'Единственный естественный спутник ЗЕМЛИ',
    image: '/img/planets/themoon.png',
    hasEarth: true,
    temp: -61,
    distance: 384400,
    tours: ['По следам Апполона-11'],
    tourDescs: [
        'Пройдите по маршруту первых лунных экспедиций и почувствуйте себя настоящим первооткрывателем. Вас ждёт прогулка по историческим районам высадок, прыжки в слабой гравитации и поездка на современном луноходе по тихим лунным равнинам. Наблюдать Землю над горизонтом Луны — отдельное удовольствие. А вечером на борту подают горячий космический чай и блюда по рецептам ранних орбитальных миссий.'
    ],
    tourImages: ['/img/tours/moon_tour.svg'],
    facts: [
        {
            icon: 'rover.svg',
            title: 'Обитатели',
            description: 'Один активный китайский луноход Yutu-2',
        },
        {
            icon: 'temp.svg',
            title: 'Переменчивая температура',
            description:
                'От +127 °C днём у экватора до -249 °C в затенённых кратерах',
        },
        {
            icon: 'ruler.svg',
            title: 'Площадь: 38 млн км²',
            description: 'Примерно в 2,2 раза больше площади России',
        },
    ],
    score: 1.8,
    stats: {
        climate: 10,
        temperature: 45,
        distance: 5
    },
}

export const planets = [
    {
        id: 'mercury',
        name: 'Меркурий',
        subtitle: 'Первая и самая маленькая планета солнечной системы',
        image: '/img/planets/merkurij.png',
        temp: 125,
        distance: 91700000,
        tours: ['Ближе некуда'],
        tourDescs: [
            'Самая экстремальная экспедиция солнечной системы. Посадка происходит прямо среди древних кратеров Меркурия, где поверхность освещена огромным сияющим Солнцем. Экспедиция включает исследование скалистых каньонов и прогулки по границе вечных теней. В кают-компании путешественников ждут пряные блюда, созданные специально для жарких миров, и рассказы о первых попытках изучения планеты ещё в эпоху ранней космической астрономии.'
        ],
        tourImages: ['/img/tours/merkurij_tour.svg'],
        facts: [
            {
                icon: 'holes.svg',
                title: 'Обитатели',
                description: 'Гигантские кратеры',
            },
            {
                icon: 'temp.svg',
                title: 'Температура',
                description: 'От -180°C до +430°C',
            },
            {
                icon: 'ruler.svg',
                title: 'Близость',
                description: 'Самая близкая к солнцу планета',
            },
        ],
        score: 6.5,
        stats: {
            climate: 80,
            temperature: 95,
            distance: 40
        },
    },

    {
        id: 'venus',
        name: 'Венера',
        subtitle: 'Вторая и самая горячая планета солнечной системы',
        image: '/img/planets/venera.svg',
        temp: 460,
        distance: 41400000,
        tours: ['Золотая завеса'],
        tourDescs: [
            'Сквозь плотные облака Венеры открывается мир, который долгое время оставался лишь догадкой учёных. Экспедиция проходит по лавовым равнинам и загадочным каменным формациям, едва различимым в золотистой дымке атмосферы. Когда-то первые автоматические станции передали несколько туманных снимков поверхности. Сегодня вы сможете увидеть этот мир своими глазами.'
        ],
        tourImages: ['/img/tours/venera_tour.svg'],
        facts: [
            {
                icon: 'cloud.svg',
                title: 'Обитатели',
                description: 'Сернокислотные облака и дожди из кислоты',
            },
            {
                icon: 'temp.svg',
                title: 'Самая жаркая планета',
                description: 'Температура в среднем +460°C',
            },
            {
                icon: 'reverse.svg',
                title: 'Вращение в обратном направлении',
                description: 'Солнце встает на западе, а заходит на востоке',
            },
        ],
        score: 8.6,
        stats: {
            climate: 100,
            temperature: 100,
            distance: 35
        },
    },

    {
        id: 'earth',
        name: 'Земля',
        subtitle: 'Ваше местоположение',
        showPin: true,
        image: '/img/planets/theEarth.svg',
        hasMoon: true,
        temp: 15,
        distance: 0,
        tours: ['Полюс холода. Оймякон', 'Станция восток'],
        tourDescs: [
            'Добро пожаловать в одно из самых холодных мест планеты. Экспедиция переносит вас в сердце якутской зимы: поездки на упряжках, северное сияние и жизнь в настоящем полярном лагере. Здесь мороз становится частью пейзажа.',
            'Путешествие на легендарную антарктическую станцию — это знакомство с одним из самых удалённых мест Земли. Бескрайние ледяные равнины и бесконечное небо Антарктиды создают атмосферу настоящей научной экспедиции.'
        ],
        tourImages: ['/img/tours/earth_tour_one.svg', '/img/tours/earth_tour_two.svg'],
        facts: [
            {
                icon: 'human.svg',
                title: 'Обитатели',
                description: '8 272 345 242 человек',
                counter: true,
            },
            {
                icon: 'temp.svg',
                title: 'Лучшая для жизни планета',
                description: 'Температура всреднем 15°C',
            },
            {
                icon: 'messages.svg',
                title: 'Языки',
                description:
                    '普通话, English, हिन्दी, Русский, العربية, Español, Português, 日本語, Français, বাংলা, Deutsch......',
            },
        ],
        score: 0.0,
        stats: {
            climate: 15,
            temperature: 55,
            distance: 0
        },
    },

    {
        id: 'mars',
        name: 'Марс',
        subtitle: 'Четвёртая и самая исследуемая планета солнечной системы',
        image: '/img/planets/mars.svg',
        temp: -60,
        distance: 78300000,
        tours: ['Сафари на марсоходах', 'Фотоохота на марсиан'],
        tourDescs: [
            'Испытайте настоящее приключение на красной планете. На мощных марсоходах экспедиция проходит через пыльные равнины, древние кратеры и высохшие русла рек.',
            'Марс всегда вдохновлял воображение исследователей. В этом туре вы отправитесь к древним пещерам и расщелинам, где иногда фиксируются необычные сигналы.'
        ],
        tourImages: ['/img/tours/mars_tour_1.svg', '/img/tours/mars_tour_2.svg'],
        facts: [
            {
                icon: 'rover.svg',
                title: 'Обитатели',
                description: '2 активных марсохода NASA',
            },
            {
                icon: 'temp.svg',
                title: 'Температура',
                description: 'В среднем -60°C',
            },
            { icon: 'alien.svg', title: 'Языки', description: '⋔⏃⍀⌇⟟⏃⋏⌇☍⟟⊬' },
        ],
        score: 2.8,
        stats: {
            climate: 45,
            temperature: 65,
            distance: 55
        },
    },

    {
        id: 'jupiter',
        name: 'Юпитер',
        subtitle: 'Пятая и самая большая планета солнечной системы',
        image: '/img/planets/jupiter.svg',
        temp: -130,
        distance: 628700000,
        tours: ['Вихрь гигантов'],
        tourDescs: [
            'Отправляйтесь в потрясающий своей масштабностью тур «Вихрь гигантов» на Юпитер — самую большую планету нашей системы. Находясь на безопасной и комфортной орбитальной наблюдательной станции, вы вживую увидите суровую мощь газового гиганта: бушующие облака и бесконечные гигантские штормы, в которых легко поместилась бы вся Земля. Главным событием станет потрясающий вид на знаменитое Большое красное пятно — чудовищный антициклон (гигантский атмосферный вихрь), который не утихает уже сотни лет, поражая своими разрушительными масштабами без всяких прикрас.'
        ],
        tourImages: ['/img/tours/jupiter_tour.svg'],
        facts: [
            {
                icon: 'cloud.svg',
                title: 'Обитатели',
                description: 'Гигантское пятно мощнейшего урагана',
            },
            {
                icon: 'temp.svg',
                title: 'Температура',
                description: 'В среднем -130°C',
            },
            {
                icon: 'children.svg',
                title: 'Многодетная планета',
                description: 'Имеет 95 спутников и уступает лишь Сатурну',
            },
        ],
        score: 7.8,
        stats: {
            climate: 95,
            temperature: 70,
            distance: 75
        },
    },

    {
        id: 'saturn',
        name: 'Сатурн',
        subtitle: 'Шестая планета солнечной системы с самой маленькой плотностью',
        image: '/img/planets/saturn.png',
        temp: -180,
        distance: 1275000000,
        tours: ['Кольцевая линия'],
        tourDescs: [
            'Отправляйтесь в одно из самых красивых и завораживающих путешествий в космосе — эксклюзивный тур «Кольцевая линия» прямиком к Сатурну. Во время безопасной прогулки на панорамном космическом шаттле вы окажетесь прямо среди знаменитых колец планеты, где миллиарды ледяных частиц и осколков ослепительно отражают свет далекого Солнца. Это уникальная возможность своими глазами вблизи рассмотреть безупречную орбитальную геометрию и почувствовать колоссальный масштаб величественного газового гиганта.'
        ],
        tourImages: ['/img/tours/saturn_tour.svg'],
        facts: [
            {
                icon: 'circle.svg',
                title: 'Обитатели',
                description: 'Гигантское кольцо льда',
            },
            {
                icon: 'temp.svg',
                title: 'Температура',
                description: 'В среднем -180°C',
            },
            {
                icon: 'light.svg',
                title: 'Масса и плотность',
                description:
                    'Масса больше Земли в 95 раз, а плотность в 1.5 раза меньше чем плотность воды',
            },
            {
                icon: 'children.svg',
                title: '274 спутника',
                description:
                    'Это больше, чем у всех вместе взятых планет солнечной системы',
            },
        ],
        score: 7.2,
        stats: {
            climate: 90,
            temperature: 80,
            distance: 85
        },
    },

    {
        id: 'uranus',
        name: 'Уран',
        subtitle: 'Седьмая и самая холодная планета солнечной системы',
        image: '/img/planets/uran.png',
        temp: -224,
        distance: 2724000000,
        tours: ['Алмазный дождь', 'Ледяной штиль'],
        tourDescs: [
            'Отправляйтесь в эксклюзивный тур «Алмазный дождь» на Уран, где колоссальное давление планеты буквально выдавливает углерод из газа метана, превращая его в настоящие драгоценные камни. Из безопасного сверхпрочного модуля вы своими глазами увидите, как эти кристаллы непрерывно падают сквозь жидкие слои ледяного гиганта в виде сверкающего града. Это ваш шанс вживую понаблюдать за суровой физикой космоса и масштабным процессом, который ученые долгие годы считали лишь математической теорией.',
            'Отправляйтесь в уникальный релакс-тур «Ледяной штиль» на Уран, созданный для тех, кто ищет абсолютного спокойствия и редкой космической тишины. На борту панорамного круизного лайнера вы сможете часами наблюдать, как в криогенной (сверххолодной) атмосфере ледяного гиганта неспешно плывут метановые облака, складываясь в гипнотические голубые узоры. Это идеальный шанс отвлечься от земной суеты и погрузиться в умиротворяющую эстетику самой холодной планеты Солнечной системы, наслаждаясь видами, которые раньше были доступны только исследовательским беспилотным аппаратам.'
        ],
        tourImages: ['/img/tours/uranus_tour_1.svg', '/img/tours/uranus_tour_2.svg'],
        facts: [
            {
                icon: 'crystal.svg',
                title: 'Обитатели',
                description: 'Холодные кристаллы метана',
            },
            {
                icon: 'temp.svg',
                title: 'Самая холодная планета',
                description: 'В среднем -224°C',
            },
        ],
        score: 7.7,
        stats: {
            climate: 85,
            temperature: 90,
            distance: 95
        },
    },

    {
        id: 'neptune',
        name: 'Нептун',
        subtitle: 'Восьмая и самая удалённая от солнца',
        image: '/img/planets/neptun.png',
        temp: -220,
        distance: 4351000000,
        tours: ['Синий предел'],
        tourDescs: [
            'Отправляйтесь в самую далёкую экспедицию Солнечной системы — эксклюзивный тур «Синий предел» на Нептун, где вас встретит завораживающий, глубокий синий цвет бесконечной атмосферы. С борта сверхпрочного корабля вы вживую понаблюдаете за самыми мощными ураганами в нашем космическом районе, скорость которых превышает 2000 километров в час. Это суровое и невероятно масштабное зрелище позволит вам в полной мере ощутить первобытную мощь ледяного гиганта, находясь на самом краю нашего обитаемого мира.'
        ],
        tourImages: ['/img/tours/neptune_tour.svg'],
        facts: [
            {
                icon: 'wind.svg',
                title: 'Обитатели',
                description: 'Сверхзвуковые ветры до 2100 км/ч',
            },
            {
                icon: 'temp.svg',
                title: 'Температура',
                description: 'В среднем -220°C',
            },
        ],
        score: 8.4,
        stats: {
            climate: 95,
            temperature: 95,
            distance: 100
        },
    },

    {
        id: 'pluto',
        name: 'Плутон',
        subtitle: 'Карликовая планета',
        image: '/img/planets/pluton.png',
        temp: -230,
        distance: 5906000000,
        tours: [],
        tourDescs: [],
        tourImages: [],
    },
]